-------------------------------------------------------------------
## Machine Learning 용어들
-------------------------------------------------------------------

# 정보이득





# 감독학습





# 비감독학습






# 의사결정트리
























-------------------------------------------------------------------
## Machine Learning Algorithms 알고리즘
-------------------------------------------------------------------




# ID3 알고리즘 (분류)




# K-means (군집)




# DBSCAN 
	Data
	Based
	Spatial
	Clustering of
	Applications with
	Noise

		






























